; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 2941)
	(= (fuel plane1) 26)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at plane2 city5)
	(= (capacity plane2) 9231)
	(= (fuel plane2) 875)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city1)
	(= (capacity plane3) 7229)
	(= (fuel plane3) 565)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 7)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at person1 city6)
	(at person2 city5)
	(at person3 city1)
	(at person4 city6)
	(at person5 city3)
	(at person6 city2)
	(at person7 city4)
	(at person8 city5)
	(at person9 city7)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 537)
	(= (distance city0 city2) 591)
	(= (distance city0 city3) 663)
	(= (distance city0 city4) 547)
	(= (distance city0 city5) 702)
	(= (distance city0 city6) 843)
	(= (distance city0 city7) 705)
	(= (distance city0 city8) 914)
	(= (distance city1 city0) 537)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 594)
	(= (distance city1 city3) 740)
	(= (distance city1 city4) 851)
	(= (distance city1 city5) 759)
	(= (distance city1 city6) 569)
	(= (distance city1 city7) 849)
	(= (distance city1 city8) 937)
	(= (distance city2 city0) 591)
	(= (distance city2 city1) 594)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 858)
	(= (distance city2 city4) 536)
	(= (distance city2 city5) 907)
	(= (distance city2 city6) 791)
	(= (distance city2 city7) 998)
	(= (distance city2 city8) 930)
	(= (distance city3 city0) 663)
	(= (distance city3 city1) 740)
	(= (distance city3 city2) 858)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 755)
	(= (distance city3 city5) 659)
	(= (distance city3 city6) 845)
	(= (distance city3 city7) 651)
	(= (distance city3 city8) 627)
	(= (distance city4 city0) 547)
	(= (distance city4 city1) 851)
	(= (distance city4 city2) 536)
	(= (distance city4 city3) 755)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 851)
	(= (distance city4 city6) 931)
	(= (distance city4 city7) 982)
	(= (distance city4 city8) 860)
	(= (distance city5 city0) 702)
	(= (distance city5 city1) 759)
	(= (distance city5 city2) 907)
	(= (distance city5 city3) 659)
	(= (distance city5 city4) 851)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 510)
	(= (distance city5 city7) 519)
	(= (distance city5 city8) 951)
	(= (distance city6 city0) 843)
	(= (distance city6 city1) 569)
	(= (distance city6 city2) 791)
	(= (distance city6 city3) 845)
	(= (distance city6 city4) 931)
	(= (distance city6 city5) 510)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 673)
	(= (distance city6 city8) 567)
	(= (distance city7 city0) 705)
	(= (distance city7 city1) 849)
	(= (distance city7 city2) 998)
	(= (distance city7 city3) 651)
	(= (distance city7 city4) 982)
	(= (distance city7 city5) 519)
	(= (distance city7 city6) 673)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 653)
	(= (distance city8 city0) 914)
	(= (distance city8 city1) 937)
	(= (distance city8 city2) 930)
	(= (distance city8 city3) 627)
	(= (distance city8 city4) 860)
	(= (distance city8 city5) 951)
	(= (distance city8 city6) 567)
	(= (distance city8 city7) 653)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city4)
	(at plane3 city1)
	(at person1 city6)
	(at person2 city4)
	(at person3 city1)
	(at person4 city4)
	(at person5 city7)
	(at person6 city7)
	(at person7 city4)
	(at person8 city8)
	(at person9 city2)
	))

(:metric minimize (+ (* 5 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane2 city5)
   changed: (fuel plane2) from 875 to 9231
   goals met: 4 of 11
2. (refuel plane1 city0)
   changed: (fuel plane1) from 26 to 2941
   goals met: 4 of 11
3. (fly plane1 city0 city4)
   deleted: (at plane1 city0)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 0 to 547, (fuel plane1) from 2941 to 2394
   goals met: 5 of 11
4. (board person2 plane2 city5)
   deleted: (at person2 city5)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 5 of 11
5. (board person8 plane2 city5)
   deleted: (at person8 city5)
   added: (in person8 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 5 of 11
6. (fly plane2 city5 city4)
   deleted: (at plane2 city5)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 547 to 3100, (fuel plane2) from 9231 to 6678
   goals met: 5 of 11
7. (debark person2 plane2 city4)
   deleted: (in person2 plane2)
   added: (at person2 city4)
   changed: (onboard plane2) from 2 to 1
   goals met: 6 of 11
8. (fly plane2 city4 city8)
   deleted: (at plane2 city4)
   added: (at plane2 city8)
   changed: (total-fuel-used) from 3100 to 5680, (fuel plane2) from 6678 to 4098
   goals met: 6 of 11
9. (debark person8 plane2 city8)
   deleted: (in person8 plane2)
   added: (at person8 city8)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 11
10. (fly plane2 city8 city4)
   deleted: (at plane2 city8)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 5680 to 8260, (fuel plane2) from 4098 to 1518
   goals met: 7 of 11
11. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 8260 to 8796, (fuel plane1) from 2394 to 1858
   goals met: 6 of 11
12. (board person6 plane1 city2)
   deleted: (at person6 city2)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 6 of 11
13. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 8796 to 9654, (fuel plane1) from 1858 to 1000
   goals met: 6 of 11
14. (board person5 plane1 city3)
   deleted: (at person5 city3)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 6 of 11
15. (fly plane1 city3 city7)
   deleted: (at plane1 city3)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 9654 to 10305, (fuel plane1) from 1000 to 349
   goals met: 6 of 11
16. (debark person5 plane1 city7)
   deleted: (in person5 plane1)
   added: (at person5 city7)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 11
17. (debark person6 plane1 city7)
   deleted: (in person6 plane1)
   added: (at person6 city7)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 11
18. (refuel plane1 city7)
   changed: (fuel plane1) from 349 to 2941
   goals met: 8 of 11
19. (board person9 plane1 city7)
   deleted: (at person9 city7)
   added: (in person9 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 8 of 11
20. (fly plane1 city7 city2)
   deleted: (at plane1 city7)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 10305 to 11303, (fuel plane1) from 2941 to 1943
   goals met: 8 of 11
21. (debark person9 plane1 city2)
   deleted: (in person9 plane1)
   added: (at person9 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 11
22. (fly plane1 city2 city6)
   deleted: (at plane1 city2)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 11303 to 12094, (fuel plane1) from 1943 to 1152
   goals met: 9 of 11
23. (board person4 plane1 city6)
   deleted: (at person4 city6)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 9 of 11
24. (fly plane1 city6 city4)
   deleted: (at plane1 city6)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 12094 to 13025, (fuel plane1) from 1152 to 221
   goals met: 10 of 11
25. (debark person4 plane1 city4)
   deleted: (in person4 plane1)
   added: (at person4 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 11 of 11
